#include	<iostream>
#include	"CEnding.h"
#include	"CSceneManager.h"
#include	"graphics.h"
#include	"input.h"

using namespace std;


//▼ 静的メンバ変数の再定義
//ウィンドウハンドル
HWND CEnding::m_hWnd = NULL;
//画像の使用枚数
const char CEnding::CENDING_IMAGE_MAX = 1;


/*
************************************************************************************
エンディングの初期化
************************************************************************************
*/
SCENE_NUM CEnding::Init(){

	//▼ 画像の読み込み
	//背景画像
	this->m_nBackImg[0] = CreateDDImage( "Image\\Bg\\Ending.bmp" , CEnding::m_hWnd );

	//初期化に失敗したらSCENE_ERRORを返す
	return SCENE_UPDATE;

}


/*
************************************************************************************
エンディングの更新
************************************************************************************
*/
SCENE_NUM CEnding::Update(){
		

	//Tでオープニングへ
	if( JustKey('T') ){
		CSceneManager::SetNextScene( GAMESCENE_OPENING );
		return SCENE_RELEASE;
	}


	return SCENE_UPDATE;

}


/*
************************************************************************************
エンディングの解放
************************************************************************************
*/
SCENE_NUM CEnding::Release(){


	//画像の解放
	for( int i = 0 ; i < CEnding::CENDING_IMAGE_MAX ; i++ ){
		ReleaseDDImage( this->m_nBackImg[i] );
	}

	//基本的にSCENE_ENDを返す
	return SCENE_END;

}


/*
************************************************************************************
エンディングの表示
************************************************************************************
*/
void CEnding::Draw(){


	//エンディング画像の表示
	DDBlt(					
		0	,		//表示座標X
		0	,		//表示座標Ｙ
		640		,		//幅
		480		,		//高さ
		this->m_nBackImg[0]		,		//画像の要素番号
		0	,		//表示元X
		0 );			//表示元座標Y
	

}


/*
************************************************************************************
エンディングのコンストラクタ
************************************************************************************
*/
CEnding::CEnding()
{
}


/*
************************************************************************************
エンディングのディストラクタ
************************************************************************************
*/
CEnding::~CEnding()
{
}

