#include	<iostream>
#include	"CGameOver.h"
#include	"CSceneManager.h"
#include	"graphics.h"
#include	"input.h"

using namespace std;


//▼ 静的メンバ変数の再定義
//ウィンドウハンドル
HWND CGameOver::m_hWnd = NULL;
//画像の使用枚数
const char CGameOver::CGAMEOVER_IMAGE_MAX = 1;


/*
************************************************************************************
ゲームオーバーの初期化
************************************************************************************
*/
SCENE_NUM CGameOver::Init(){

	//▼ 画像の読み込み
	//背景画像
	this->m_nBackImg[0] = CreateDDImage( "Image\\Bg\\GameOver.bmp" , CGameOver::m_hWnd );

	//初期化に失敗したらSCENE_ERRORを返す
	return SCENE_UPDATE;

}


/*
************************************************************************************
ゲームオーバーの更新
************************************************************************************
*/
SCENE_NUM CGameOver::Update(){


	//TでOPへ
	if( JustKey('T') ){
		CSceneManager::SetNextScene( GAMESCENE_OPENING );
		return SCENE_RELEASE;
	}
	return SCENE_UPDATE;

}


/*
************************************************************************************
ゲームオーバーの解放
************************************************************************************
*/
SCENE_NUM CGameOver::Release(){


	//画像の解放
	for( int i = 0 ; i < CGameOver::CGAMEOVER_IMAGE_MAX ; i++ ){
		ReleaseDDImage( this->m_nBackImg[i] );
	}

	//基本的にSCENE_ENDを返す
	return SCENE_END;

}


/*
************************************************************************************
ゲームオーバーの表示
************************************************************************************
*/
void CGameOver::Draw(){


	//ゲームオーバー画像の表示
	DDBlt(					
		0	,		//表示座標X
		0	,		//表示座標Ｙ
		640		,		//幅
		480		,		//高さ
		this->m_nBackImg[0]		,		//画像の要素番号
		0	,		//表示元X
		0 );			//表示元座標Y
	

}


/*
************************************************************************************
ゲームオーバーのコンストラクタ
************************************************************************************
*/
CGameOver::CGameOver()
{
}


/*
************************************************************************************
ゲームオーバーのディストラクタ
************************************************************************************
*/
CGameOver::~CGameOver()
{
}

