#include	"CCharacter.h"
#include	"MemoryLeakCheck.h"
#include	<math.h>



/*
**************************************************************************************************
コンストラクタ
**************************************************************************************************
*/
CCharacter::CCharacter(){

	this->m_Fpos.x = 0.0f;			//表示先座標X
	this->m_Fpos.y = 0.0f;			//表示先座標Y
	this->m_Ipic.x = 0;				//表示元座標X
	this->m_Ipic.y = 0;				//表示元座標Y
	this->m_Fmove.x = 0.0f;			//移動量X
	this->m_Fmove.y = 0.0f;			//移動量Y
	this->m_existFlag = false;		//生存フラグ
	this->m_Isize.x = 0;			//幅
	this->m_Isize.y = 0;			//高さ
	this->m_alpha = 0.0f;			//透過倍率
	this->m_scale = 0.0f;			//拡縮率
	this->m_direction = 0;			//方向
	this->m_kindNum = 0;			//種類番号

}

/*
**************************************************************************************************
ディストラクタ
**************************************************************************************************
*/
CCharacter::~CCharacter(){

}

