#include "gameover.h"
#include "game.h"
#include "input.h"
#include "wipe.h"

//▼グローバル変数
//画像の要素数を扱う
int g_gameoverImg[1] = {0};

//************************************************************************************************
//初期化
//************************************************************************************************
void InitGameOver(HWND hWnd){
	
	//　▼画像の読み込み
	//ゲームオーバー画像
	g_gameoverImg[0] = CreateDDImage("Image\\GameOver.bmp",hWnd);
}

//************************************************************************************************
//更新
//************************************************************************************************
void UpdateGameOver(){
	
	//キー入力で次のシーンを変更
	if(JustKey('Z') || JustButton(BUTTON_1)){
		//決定キー（ボタン）入力でオープニングシーンへ変更
		CreateWipe(SCENE_OPENING , CHANGE_SCENE , WIPE_CONTRACTION);
	}
}

//************************************************************************************************
//表示
//************************************************************************************************
void DrawGameOver(){

	//ゲームオーバー画像の表示
	DDBlt(						
		0 , 0 ,						//表示座標XＹ
		640 , 480 ,					//幅、高さ
		g_gameoverImg[0] ,			//画像の番号
		0 , 0);					//表示元座標X・Ｙ
}

//************************************************************************************************
//解放
//************************************************************************************************
void ReleaseGameOver(){
	//画像の解放
	ReleaseDDImage(g_gameoverImg[0]);
}